instruction = "    Привіт!\n" \
              "Я домовий цього залу!\n" \
              "Щоб замовити пісню просто відправ мені посилання з улюбленого стрімінгу і я спробую її знайти\n" \
              "\n" \
              "    Деталі\n" \
              "1. Ти відправляєш посилання сюди\n" \
              "2. Я шукаю у себе за пічкою\n" \
              "3. Добавляю в чергу\n" \
              "4. Твоя пісня грає!!!\n" \
              "\n" \
              "    Які посилання підійдуть?\n" \
              "З будь-якого стрімінгового сервіса(з ймовірністю 99,9% включу з youtube music)\n" \
              "Кидай сюди посилання на альбом чи плейліст з youtube music, добавлю в чергу все."

song_not_found = "Ой, не можу знайти пісню за цим посиланням"
found_this = "От що я знайшов в ютубі "
admin_instruction = "Вибери що потрібно зробити"

stop_msg = "Стоп"
pause_msg = "Пауза"
play_msg = "Включаю!"

radio_stations_msg = "Вибери радіостанцію:"

url_ok = "Працюю над посиланням"
url_bad = "Щось не так с посиланням(("
url_cant_load = "Не можу завантажити цю пісню"
starting_url_load = "Починаю завантаження"

already_selected_msg = "Вже вибрано"
orders_msg = "Замовлення"


def found_n_songs(n):
    return "Добавив " + str(n) + " пісень в чергу"


def song_name_added(name):
    return "Пісня \"" + name + "\" додана до черги"


def setting_song(name):
    return "Ставлю \"" + name + "\""
